Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.7.91/atdf/ATSAMA5D27CLD2G.atdf
        <register caption="Programmable Clock 0 Register" count="3" name="PMC_PCK" offset="0x0040" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000007" name="CSS" values="PMC_PCK__CSS"/>
          <bitfield caption="Programmable Clock Prescaler" mask="0x00000FF0" name="PRES"/>
        </register>
        <register caption="Interrupt Enable Register" name="PMC_IER" offset="0x0060" rw="W" size="4">
          <bitfield caption="8 to 24 MHz Crystal Oscillator Status Interrupt Enable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Enable" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Enable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="UTMI PLL Lock Interrupt Enable" mask="0x00000040" name="LOCKU"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Enable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Enable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Enable" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Clock Source Oscillator Selection Status Interrupt Enable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="12 MHz RC Oscillator Status Interrupt Enable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Enable" mask="0x00040000" name="CFDEV"/>
        </register>
        <register caption="Interrupt Disable Register" name="PMC_IDR" offset="0x0064" rw="W" size="4">
          <bitfield caption="8 to 24 MHz Crystal Oscillator Status Interrupt Disable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Disable" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Disable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="UTMI PLL Lock Interrupt Enable" mask="0x00000040" name="LOCKU"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Disable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Disable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Disable" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Clock Source Selection Status Interrupt Disable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="12 MHz RC Oscillator Status Interrupt Disable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Disable" mask="0x00040000" name="CFDEV"/>
        </register>
        <register caption="Status Register" name="PMC_SR" offset="0x0068" rw="R" size="4">
          <bitfield caption="8 to 24 MHz Crystal Oscillator Status" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Status" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Status" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="UPLL Clock Status" mask="0x00000040" name="LOCKU"/>
          <bitfield caption="Slow Clock Oscillator Selection" mask="0x00000080" name="OSCSELS"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Selection Status" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="12 MHz RC Oscillator Status" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="Clock Failure Detector Status" mask="0x00080000" name="CFDS"/>
          <bitfield caption="Clock Failure Detector Fault Output Status" mask="0x00100000" name="FOS"/>
          <bitfield caption="Audio PLL Lock Status" mask="0x00400000" name="APLLCKRDY"/>
          <bitfield caption="Generic Clock Status" mask="0x01000000" name="GCKRDY"/>
        </register>
        <register caption="Interrupt Mask Register" name="PMC_IMR" offset="0x006C" rw="R" size="4">
          <bitfield caption="8 to 24 MHz Crystal Oscillator Status Interrupt Mask" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Mask" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Mask" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Mask" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Mask" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Mask" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Clock Source Selection Status Interrupt Mask" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="12 MHz RC Oscillator Status Interrupt Mask" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Mask" mask="0x00040000" name="CFDEV"/>
        </register>
        <register caption="Fast Startup Mode Register" name="PMC_FSMR" offset="0x0070" rw="RW" size="4">
          <bitfield caption="Fast Startup from WKUP Pin Enable" mask="0x00000001" name="FSTT0"/>
          <bitfield caption="Fast Startup from Security Module Enable" mask="0x00000002" name="FSTT1"/>
          <bitfield caption="Fast Startup from PIOBU0-7 Input Enable" mask="0x00000004" name="FSTT2"/>
          <bitfield caption="Fast Startup from PIOBU0-7 Input Enable" mask="0x00000008" name="FSTT3"/>
          <bitfield caption="Fast Startup from PIOBU0-7 Input Enable" mask="0x00000010" name="FSTT4"/>
          <bitfield caption="Fast Startup from PIOBU0-7 Input Enable" mask="0x00000020" name="FSTT5"/>
          <bitfield caption="Fast Startup from PIOBU0-7 Input Enable" mask="0x00000040" name="FSTT6"/>
          <bitfield caption="Fast Startup from PIOBU0-7 Input Enable" mask="0x00000080" name="FSTT7"/>
          <bitfield caption="Fast Startup from PIOBU0-7 Input Enable" mask="0x00000100" name="FSTT8"/>
          <bitfield caption="Fast Startup from PIOBU0-7 Input Enable" mask="0x00000200" name="FSTT9"/>
          <bitfield caption="Fast Start-up from GMAC Wake-up On LAN Enable" mask="0x00000400" name="FSTT10"/>
          <bitfield caption="Fast Startup from RTC Alarm Enable" mask="0x00020000" name="RTCAL"/>
          <bitfield caption="Fast Startup from USB Resume Enable" mask="0x00040000" name="USBAL"/>
          <bitfield caption="Fast Startup from SDMMC Card Detect Enable" mask="0x00080000" name="SDMMC_CD"/>
          <bitfield caption="Low-power Mode" mask="0x00100000" name="LPM"/>
          <bitfield caption="Fast Startup from Backup UART Receive Match Condition Enable" mask="0x01000000" name="RXLP_MCE"/>
          <bitfield caption="Fast Startup from Analog Comparator Controller Comparison Enable" mask="0x02000000" name="ACC_CE"/>
        </register>
        <register caption="Fast Startup Polarity Register" name="PMC_FSPR" offset="0x0074" rw="RW" size="4">
          <bitfield caption="WKUP Pin Polarity for Fast Startup" mask="0x00000001" name="FSTP0"/>
          <bitfield caption="Security Module Polarity for Fast Startup" mask="0x00000002" name="FSTP1"/>
          <bitfield caption="PIOBU0-7 Pin Polarity for Fast Startup" mask="0x00000004" name="FSTP2"/>
          <bitfield caption="PIOBU0-7 Pin Polarity for Fast Startup" mask="0x00000008" name="FSTP3"/>
          <bitfield caption="PIOBU0-7 Pin Polarity for Fast Startup" mask="0x00000010" name="FSTP4"/>
          <bitfield caption="PIOBU0-7 Pin Polarity for Fast Startup" mask="0x00000020" name="FSTP5"/>
          <bitfield caption="PIOBU0-7 Pin Polarity for Fast Startup" mask="0x00000040" name="FSTP6"/>
          <bitfield caption="PIOBU0-7 Pin Polarity for Fast Startup" mask="0x00000080" name="FSTP7"/>
          <bitfield caption="PIOBU0-7 Pin Polarity for Fast Startup" mask="0x00000100" name="FSTP8"/>
          <bitfield caption="PIOBU0-7 Pin Polarity for Fast Startup" mask="0x00000200" name="FSTP9"/>
          <bitfield caption="GMAC Wake-up On LAN Polarity for Fast Start-up" mask="0x00000400" name="FSTP10"/>
        </register>
